// Написати цикли, які роблять наступне:

// Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5
// (20 20,5 21 21,5….).✅

let str = "";
for (let i = 20; i < 31; i += 0.5) {
  str += `${i}, `;
}
console.log(str); // 20, 20.5, 21, 21.5, 22, 22.5, 23, 23.5, 24, 24.5, 25, 25.5, 26, 26.5, 27, 27.5, 28, 28.5, 29, 29.5, 30, 30.5,

// Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10,
// 20, 30... 100 доларів.✅

for (let i = 10; i < 101; i += 10) {
  console.log(`${i}$ = ${i * 27}₴`);
}

// Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не
// перевищує числа N.✅

let N = 9000;

for (let i = 1; i < 101; i++) {
  if (i * i < N) {
    console.log(i); // усі до 94
  }
}

// Дане ціле число. З'ясувати, чи є воно простим (простим називається
// число, більше 1, які не мають інших дільників крім 1 і себе).✅

let a = 47;
let counter = 0;

for (let i = 2; i < a; i++) {
  if (a % i == 0) {
    counter++;
  }
}
counter == 0
  ? console.log(`${a} - просте число`)
  : console.log(`${a} - не просте число \nкількість дільників: ${counter}`);

// Дане деяке число. Визначити, чи можна одержати це число шляхом
// зведення числа 3 у деякий ступінь. (Наприклад, числа 9, 81 можна
// отримати, а 13 - не можна).✅

// let a = 81;
// let counter = 0;
// for (let i = a; i > 0; i = i / 3) {
//   if (i == 1) {
//     console.log(
//       `Так, число ${a} можна одержати шляхом зведення числа 3 у деякий ступінь.\nA саме, у ${counter} ступінь`
//     );
//   }
//   counter++;
// }
