// Написати цикли, які зможуть:

// Вивести на сторінку в один рядок через кому числа від 10 до 20. ✅

let s = "";

for (let i = 10; i < 21; i++) {
  s += `${i}, `;
}
console.log(s); // 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20,

// Вивести квадрати чисел від 10 до 20. ✅

for (let i = 10; i < 21; i++) {
  console.log(`${i} у квадраті = ${i * i}`);
}

// Вивести таблицю множення на 7. ✅

console.log("Таблиця множення на 7: ");
for (let i = 1; i < 11; i++) {
  console.log(` 7 * ${i} = ${7 * i}`);
}

// Знайти суму всіх цілих чисел від 1 до 15. ✅

let result = 0;
for (let i = 1; i < 16; i++) {
  result += i;
}
console.log(`Сума всіх цілих чисел від 1 до 15 = ${result}`);

// Знайти добуток усіх цілих чисел від 15 до 35. ✅

// let result = 1;
// for (let i = 15; i < 36; i++) {
//   result = i * result;
// }
// console.log(
//   `Добуток усіх цілих чисел від 15 до 35 = ${result.toPrecision(30)}`
// );

// Знайти середнє арифметичне всіх цілих чисел від 1 до 500. ✅

// let result = 0;
// for (let i = 1; i < 501; i++) {
//   result += i;
// }
// console.log(
//   `Cереднє арифметичне значення всіх цілих чисел від 1 до 500 = ${result / 500}`
// );

// Вивести суму лише парних чисел в діапазоні від 30 до 80. ✅

// let result = 0;
// for (let i = 30; i < 81; i++) {
//   if (i % 2 == 0) {
//     result += i;
//   }
// }
// console.log(`Cума парних чисел в діапазоні від 30 до 80 = ${result}`);

// Вивести всі числа в діапазоні від 100 до 200 кратні 3. ✅

for (let i = 100; i < 201; i++) {
  if (i % 3 == 0) {
    console.log(i);
  }
}

// Дано натуральне число. Знайти та вивести на сторінку всі його дільники. ✅
// Визначити кількість його парних дільників. ✅
// Знайти суму його парних дільників. ✅

let a = 8;
let counter = 0;
let sum = 0;

for (let i = 1; i < a + 1; i++) {
  if (a % i == 0) {
    console.log(i); // 1, 2, 4, 8
    if (i % 2 == 0) {
      counter++;
      sum += i;
    }
  }
}

console.log(`Кількість парних дільників: ${counter}`); // 3
console.log(`Сума парних дільників: ${sum}`); // 14

// Надрукувати повну таблицю множення від 1 до 10. ✅

for (let i = 1; i < 11; i++) {
  console.log(`Таблиця множення на ${i}:`);
  for (let j = 1; j < 11; j++) {
    console.log(`${i} * ${j} = ${i * j}`);
  }
}
